# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes

#yolov5n
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
#yolov5s
#depth_multiple: 0.33  # model depth multiple
#width_multiple: 0.50  # layer channel multiple
#anchors:tongzi
#  - [13,13, 33,23]  # P3/8:16,16, 30,20
#  - [ 62,45, 90,80]  # P4/16:60,60,120,75
#  - [160,106, 240,240]  # P5/32:150,150,

#paigow:1.0,1.65
#anchors:
#  - [13,13, 26,16, 33,33]  # P3/8
#  - [57,35, 52,52, 108,66]  # P4/16
#  - [110,110, 198,120, 320,320]  # P5/32


#poker(2022-09-05) 1.1,1.6,2.5
#anchors:
#  - [14,13, 30,13, 36,23]  # P3/8
#  - [51,49, 68,30, 90,60]  # P4/16
#  - [128,116, 198,88, 260,173]  # P5/32

#poker_rect(2022-09-14) 0.9,1.9,3.0
anchors:
  - [11,12, 30,16, 36,12]  # P3/8
  - [34,34, 68,36, 120,40]  # P4/16
  - [86,86, 174,92, 300,100]  # P5/32

#anchors:
#  - [10,13, 16,30, 33,23]  # P3/8
#  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32


#anchors: #shuffle_poker 0.6,2.6,512
#  - [10,16, 30,12, 24,40]  # P3/8
#  - [61,23, 45,75, 119,45]  # P4/16
#  - [90,150, 200,76, 180,300]  # P5/32
#anchors: #shuffle_poker 0.6,2.6,352
#  - [8,13, 26,10, 18,30]  # P3/8
#  - [52,20, 36,60, 104,40]  # P4/16
#  - [72,120, 208,80, 144,240]  # P5/32


#paigow_long:,1.1,0.6
#anchors:
#  - [14,13, 16,26, 36,33]  # P3/8
#  - [35,57, 57,52, 66,108]  # P4/16
#  - [121,110, 120,198, 352,320]  # P5/32


#anchors: #crane
#  - [16,13, 38,12, 48,40]  # P3/8
#  - [68,23, 93,78, 138,46]  # P4/16
#  - [168,140, 240,80, 384,320]  # P5/32


#tongzi,1.0,1.5,2.0,->0.9,1.5,2.3
#anchors:
#  - [13,14, 30,13, 36,24]  # P3/8
#  - [46,51, 68,30, 90,60]  # P4/16
#  - [116,128, 198,88, 260,173]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
